Merge pull request #1 from crypticani/docs/diagrams-and-cheatsheets
Docs/diagrams and cheatsheets
